Revit 2024 API
RevitServerCollaborationNotAvailableException Class
The exception that is thrown when Collaboration fails because of an external resource (e.g., Amazon S3) failure.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[SerializableAttribute]
public class RevitServerCollaborationNotAvailableException : RevitServerException
Visual Basic
<SerializableAttribute> _
Public Class RevitServerCollaborationNotAvailableException _
	Inherits RevitServerException
Visual C++
[SerializableAttribute]
public ref class RevitServerCollaborationNotAvailableException : public RevitServerException
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.RevitServerException
 Autodesk.Revit.Exceptions.RevitServerCollaborationNotAvailableException
See Also
RevitServerCollaborationNotAvailableException Members
Autodesk.Revit.Exceptions Namespace